app/views/blogs/index.html.erb

        <td><%=availd.status%></td>
        <td><%=User.where('rolls=?',true).first.name%></td>
---
SELECT  `users`.* FROM `users` WHERE (rolles=1)  ORDER BY `users`.`id` ASC LIMIT 1