app/views/leave_availd_details/edit.html.erb

SELECT  `leave_types`.* FROM `leave_types` WHERE `leave_types`.`id` = 2  ORDER BY `leave_types`.`id` ASC LIMIT 1
SELECT `leave_types`.* FROM `leave_types`
---
 		<td>
        <%#= select_tag :hobbies, options_for_select(LeaveType.all.collect { |e| [e.name,e.id]}),
          {:include_blank => LeaveType.where(id: @leave_availd.first.leave_type).collect{ |l| [l.name,l.id]}} %>
          <%=select_tag :hobbies,options_for_select(LeaveType.all.collect { |e| [e.name,e.id]}),:include_blank=>'Please Seletc LeaveType'%>