app/views/leave_availd_details/new.html.erb

SELECT `leave_types`.* FROM `leave_types`
---
 		<td style="width: 140px">Leave Type</td>
 		<td><%#=collection_select(:post, :leave_type_id, LeaveType.all, :id,:name,:prompt=>true)%>