app/controllers/blogs_controller.rb

SELECT `employee_leave_balances`.* FROM `employee_leave_balances` WHERE `employee_leave_balances`.`user_id` = 6
SELECT `leave_availd_details`.* FROM `leave_availd_details` WHERE `leave_availd_details`.`user_id` = 1 AND `leave_availd_details`.`status` = 'InProcess'
---
  def index
    @user = current_user
    @emp_leave_balance = EmployeeLeaveBalance.where(:user_id=>@user.id)
    @leave_availd = LeaveAvaildDetail.where(:user_id=>@user.id,:status=>'InProcess')

SELECT `leave_types`.* FROM `leave_types`
---
  def new
  	@leave_type=LeaveType.all

INSERT INTO `leave_types` (`name`, `total_leave`, `status`, `created_at`, `updated_at`) VALUES ('Priv', 5, 'Active', '2019-11-15 15:41:56', '2019-11-15 15:41:56')
INSERT INTO `employee_leave_balances` (`user_id`, `leave_type_id`, `status`, `total`, `leave_availd`, `balance`, `created_at`, `updated_at`) VALUES (1, 17, 'Active', 10, 0, 10, '2019-11-15 16:31:47', '2019-11-15 16:31:47')
---
  def create
    @leave_type = LeaveType.create(:name=>params[:name],:total_leave=>params[:total_leave],:status=>'Active')
    @emp_leave_balance = EmployeeLeaveBalance.create_new_leave(@leave_type)

SELECT  `leave_types`.* FROM `leave_types` WHERE `leave_types`.`id` = 18 LIMIT 1
DELETE FROM `leave_types` WHERE `leave_types`.`id` = 18
---
  def deleting_leave_type
    @leave_type = LeaveType.find_by_id(params[:id])
    @leave_type.destroy