app/controllers/leave_availd_details_controller.rb

SELECT `leave_availd_details`.* FROM `leave_availd_details` WHERE `leave_availd_details`.`status` = 'InProcess'
---
  def index
    @leave_availd = LeaveAvaildDetail.where(:status=>'InProcess')

SELECT `leave_types`.* FROM `leave_types`
---
	def new
		@leave_type =LeaveType.all

SELECT `leave_availd_details`.* FROM `leave_availd_details` WHERE (from_date >= ('2019-11-23') and to_date <= ('2019-11-23') and user_id =1 and status!='Approved')
INSERT INTO `leave_availd_details` (`user_id`, `leave_type_id`, `from_date`, `to_date`, `no_of_days`, `status`, `reasion`, `created_at`, `updated_at`) VALUES (6, 1, '2019-11-11', '2019-11-12', 2, 'InProcess', 'Personnel work', '2019-11-14 15:44:55', '2019-11-14 15:44:55')
---
    def create
      leave_type=params[:leave_type_id]
      from=params[:datepicker].to_date
      to=params[:datepicker1].to_date
      user = current_user
      reasion = params[:reasion]
      priveos = LeaveAvaildDetail.where('from_date >= (?) and to_date <= (?) and user_id =? and status!=?',from.strftime("%F"),to.strftime("%F"),user.id,'Approved')
       if priveos.blank?
       @leave_availd = LeaveAvaildDetail.create_user_leaves(user,from,to,leave_type,reasion)

SELECT  `leave_availd_details`.* FROM `leave_availd_details` WHERE `leave_availd_details`.`id` IS NULL  ORDER BY `leave_availd_details`.`id` ASC LIMIT 1
---
    def edit
    	@leave_availd = LeaveAvaildDetail.where(:id=>params[:id])

UPDATE `leave_availd_details` SET `from_date` = '2019-11-16', `to_date` = '2019-11-18', `no_of_days` = 3, `updated_at` = '2019-11-15 16:51:38' WHERE `leave_availd_details`.`id` = 1
---
    def updating
     a=params[:datepicker].to_date
     b=params[:datepicker1].to_date
     c = (b - a).to_i
     @leave_update = LeaveAvaildDetail.update_leave(params,c)

SELECT  `leave_availd_details`.* FROM `leave_availd_details` WHERE `leave_availd_details`.`id` = 1 LIMIT 1
UPDATE `leave_availd_details` SET `status` = 'Rejected', `updated_at` = '2019-11-15 17:56:20' WHERE `leave_availd_details`.`id` = 1
---
    def reject_leave
      leave =LeaveAvaildDetail.find(params[:id])
      if leave.present?
        leave.update_attribute("status","Rejected")

SELECT  `leave_availd_details`.* FROM `leave_availd_details` WHERE `leave_availd_details`.`id` = 1 LIMIT 1
DELETE FROM `leave_availd_details` WHERE `leave_availd_details`.`id` = 1
---
    def cancel_leave
      leave =LeaveAvaildDetail.find(params[:id])
      if leave.present?
        UserMailer.cancel_leave(leave).deliver_now
        leave.destroy